import time
import requests
import psycopg2
from psycopg2.extras import execute_values

db = {
    "dbname": "visi_db",
    "user": "semenbarinov",
    "password": "semenbarinov",
    "host": "localhost",
    "port": "5432"}

GROUPS = [
    "М092501(70)", "М092501(71)", "М092501(72)", "М092501(77)",
    "М092401(71)", "М092401(75)", "М092401(76)", "М102501(72)",
    "М102501(73)", "М152501(72)", "М272501(72)", "М102401(72)",
    "М152401", "М272401", "МИТ2501", "МРА2501", "МРТ2501",
    "МИТ2401", "МРА2401", "МРТ2401", "М62501(75)", "М62501(76)",
    "М62401", "М62402", "МБА2501", "МБИ2501", "МЭЭ2501",
    "МЭЭ2401", "МАС2531", "МСИ2531", "МЭЦ2531", "МАС2431",
    "МСИ2431", "МЭЦ2431", "ЗРС2501", "ЗРС2502", "ЗРС2503",
    "ЗРС2401", "ЗРС2402", "ЗРС2205", "ЗРС2301", "ЗРС2302",
    "ЗРС2303", "ЗРС2304", "ЗРС2201", "ЗРС2202", "ЗРС2203",
    "ЗРС2101", "ЗРС2102", "АИТ2501(1)", "АИТ2501(6)", "АИТ2501(8)",
    "АЭМ2501(6)", "АЭР2501(3)", "АЭФ2501(13)", "АЭФ2501(15)",
    "АИТ2401(1)", "АИТ2401(6)", "АКИ2401(1)", "АЭМ2401(6)",
    "АЭР2401(3)", "АЭФ2401(13)", "АЭФ2401(15)", "БВТ2551",
    "БВТ2552", "БВТ2553", "БВТ2554", "УБВТ2501", "УБВТ2502",
    "УБВТ2503", "УБВТ2504", "УБВТ2505", "БВТ2451", "БВТ2452",
    "БВТ2453", "БВТ2454", "УБВТ2401", "УБВТ2402", "УБВТ2403",
    "УБВТ2404", "УБВТ2405", "БВТ2351", "БВТ2352", "БВТ2353",
    "БВТ2354", "БВТ2355", "БВТ2356", "БВТ2251", "БВТ2252",
    "БВТ2253", "БВТ2254", "БВТ2255", "БВТ2256", "БВТ2151",
    "ББД2501", "ББД2502", "ББД2503", "ББД2504", "ББД2505",
    "ББД2506", "БЭМ2501", "БЭМ2502", "БЭМ2503", "БЭМ2504",
    "БЭМ2505", "БЭМ2506", "БЭР2501", "БЭР2502", "БЭР2503",
    "БЭР2504", "ББИ2401", "ББИ2402", "БЭР2401", "БЭР2402",
    "БЭЭ2401", "БЭЭ2402", "ББИ2301", "ББИ2302", "ББИ2303",
    "ББИ2304", "БЭР2301", "БЭР2302", "БЭЭ2301", "БЭЭ2302",
    "ББИ2201", "ББИ2202", "БЭР2201", "БЭР2202", "БЭЭ2201",
    "БВТ2501", "БВТ2502", "БВТ2503", "БВТ2504", "БВТ2505",
    "БВТ2506", "БВТ2507", "БВТ2508", "БВТ2509", "БВТ2510",
    "БКН2501", "БПИ2501", "БПИ2502", "БПИ2503", "БПИ2504",
    "БПИ2505", "БПИ2506", "БПИ2507", "БПИ2508", "БПС2501",
    "БПС2502", "БПС2503", "БПС2504", "БСТ2501", "БСТ2502",
    "БСТ2503", "БСТ2504", "БСТ2505", "БСТ2506", "БВТ2401",
    "БВТ2402", "БВТ2403", "БВТ2404", "БПИ2401", "БПИ2402",
    "БПИ2403", "БПИ2404", "БПС2401", "БПС2402", "БСТ2401",
    "БСТ2402", "БСТ2403", "БФИ2401", "БФИ2402", "БВТ2301",
    "БВТ2302", "БВТ2303", "БВТ2304", "БВТ2305", "БПИ2301",
    "БПИ2302", "БПИ2303", "БПИ2304", "БСТ2301", "БСТ2302",
    "БСТ2303", "БСТ2304", "БФИ2301", "БФИ2302", "БЭИ2301",
    "БЭИ2302", "БЭИ2303", "БВТ2201", "БВТ2202", "БВТ2203",
    "БВТ2204", "БВТ2205", "БСТ2201", "БСТ2202", "БСТ2203",
    "БСТ2204", "БФИ2201", "БФИ2202", "БФИ2203", "БЭИ2201",
    "БЭИ2202", "БАП2501", "БАП2502", "БАС2501", "БАС2502",
    "БАС2503", "БКС2501", "БКС2502", "БКС2503", "БКС2504",
    "БКС2505", "БКС2506", "БМИ2501", "БУТ2501", "БУТ2502",
    "БАП2401", "БАП2402", "БАС2401", "БАС2402", "БКС2401",
    "БКС2402", "БКС2403", "БМИ2401", "БМИ2402", "БПМ2401",
    "БУТ2401", "БУТ2402", "БАП2301", "БАС2301", "БАС2302",
    "БАС2303", "БКС2301", "БКС2302", "БКС2303", "БМИ2301",
    "БПМ2301", "БУТ2301", "БАП2201", "БАС2201", "БАС2202",
    "БАС2203", "БКС2201", "БКС2202", "БКС2203", "БПМ2201",
    "БУТ2201", "БИК2501", "БИК2502", "БИК2503", "БИК2504",
    "БИК2505", "БИК2506", "БИК2507", "БИК2508", "БИК2509",
    "БРТ2501", "БРТ2502", "БРТ2503", "БРТ2504", "БИК2401",
    "БИК2402", "БИК2403", "БИК2404", "БИК2405", "БИК2406",
    "БИК2407", "БИК2408", "БИК2409", "БРТ2401", "БРТ2402",
    "БРТ2403", "БРА2301", "БРА2302", "БРИ2301", "БРИ2302",
    "БРК2301", "БРК2302", "БРМ2301", "БРМ2302", "БРР2301",
    "БРА2201", "БРА2202", "БРВ2201", "БРВ2202", "БРИ2201",
    "БРИ2202", "БРК2201", "БРМ2201", "БРМ2202", "БРР2201",
    "БИН2501", "БИН2502", "БИН2503", "БИН2504", "БИН2505",
    "БИН2506", "БИН2507", "БИН2508", "БИН2509", "БИН2510",
    "БИН2511", "БИН2512", "БИН2401", "БИН2402", "БИН2403",
    "БИН2404", "БИН2405", "БИН2406", "БИН2407", "БИН2408",
    "БИН2409", "БИН2410", "БИН2411", "БИН2412", "БЗС2301",
    "БЗС2302", "БКК2301", "БКК2302", "БКК2303", "БКК2304",
    "БПАС2301", "БПАС2302", "БСС2301", "БСС2302", "БСС2303",
    "БСС2304", "БЗС2201", "БЗС2202", "БКК2201", "БКК2202",
    "БКК2203", "БКК2204", "БСС2201", "БСС2202", "БСС2203",
    "БСС2204"
]
API_URL = "https://mtuci.ru/bitrix/services/main/ajax.php?c=mtuci:timetable&action=getTimetableByValue&mode=class"
HEADERS = {
    "User-Agent": "Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/120.0.0.0 Safari/537.36",
    "X-Requested-With": "XMLHttpRequest"
}

def parse():
    sessid = input("sessid: ")
    if not sessid:
        return

    session = requests.Session()
    session.headers.update(HEADERS)

    data_buffer = {}

    for group in GROUPS:
        payload = {
            "VALUE": group,
            "MONTH": "5",
            "TYPE": "group",
            "SITE_ID": "s3",
            "sessid": sessid
        }

        try:
            response = session.post(API_URL, data=payload, timeout=15)
            if response.status_code == 200:
                res_json = response.json()

                if res_json.get("status") == "success":
                    raw_days = res_json.get("data", {}).get("days", {})

                    for date, lessons in raw_days.items():
                        for lesson in lessons:
                            aud = lesson.get("UF_AUDIENCE", ["Не указана"])[0]
                            num = lesson.get("UF_NUMBER")

                            if aud != "Не указана":
                                key = (date, num)
                                if key not in data_buffer:
                                    data_buffer[key] = set()
                                data_buffer[key].add(aud)
        except:
            pass


        time.sleep(1)

    save_db(data_buffer)


def save_db(data_buffer):
    try:
        connection = psycopg2.connect(**db)
        cursor = connection.cursor()

        values = [(k[0], k[1], list(v)) for k, v in data_buffer.items()]

        query = """
        INSERT INTO timetable (date, lesson_number, busy_rooms)
        VALUES %s
        ON CONFLICT (date, lesson_number) 
        DO UPDATE SET busy_rooms = array(SELECT DISTINCT unnest(timetable.busy_rooms || EXCLUDED.busy_rooms));
        """

        execute_values(cursor, query, values)
        connection.commit()
        cursor.close()
        connection.close()
    except:
        pass

parse()
#bf430fd0a1e8eefa922989f4e5b5f043